{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report linking a slug-validation publish requirement to two frontend files.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their purpose and behavior.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining required assets and steps for building the Valentine SPA.",
  "frontend/index.css": "Tailwind base and theme variable definitions with light and dark mode color tokens.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the SPA root element.",
  "frontend/src/App.tsx": "Main SPA component wiring together layout, sections, localStorage state, memory images, and edit panel.",
  "frontend/src/components/valentine/DeploymentHealthOverlay.tsx": "Empty file containing no implementation.",
  "frontend/src/components/valentine/EditPanel.tsx": "Editor side panel allowing content editing, image management, and Version 9 slug‑validated publishing workflow.",
  "frontend/src/components/valentine/FooterSection.tsx": "Footer showing sender name, year, and a tracked attribution link.",
  "frontend/src/components/valentine/HeroSection.tsx": "Hero section with animated heart decorations, headline, and a button scrolling to the letter.",
  "frontend/src/components/valentine/LoveLetterSection.tsx": "Card-styled letter section showing recipient, body text, and sender with romantic formatting.",
  "frontend/src/components/valentine/MemoriesGallery.tsx": "Six‑slot polaroid-style gallery with normalization, fallback images, hover effects, and lightbox support.",
  "frontend/src/components/valentine/MemoriesSection.tsx": "Renders a themed memories section with a title and a MemoriesGallery using provided images and captions.",
  "frontend/src/components/valentine/MemoryLightbox.tsx": "Displays a fullscreen dialog showing a selected memory image with optional caption and a close button.",
  "frontend/src/components/valentine/PublishBlockedScreen.tsx": "Empty file with no implementation.",
  "frontend/src/components/valentine/ReasonsSection.tsx": "Shows a grid of cards listing reasons, each styled with icons and decorative effects.",
  "frontend/src/components/valentine/ValentineLayout.tsx": "Provides a page layout with fixed background texture, gradient overlay, and wrapped content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context and provider offering login, logout, and identity state.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook for syncing a state value with localStorage including error handling.",
  "frontend/src/hooks/useMemoryImages.ts": "Manages six memory images with defaults, localStorage persistence, and helpers for updating and resetting images.",
  "frontend/src/index.css": "Defines Tailwind base styles and a Valentine-themed color scheme plus polaroid-style frame utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and loads global styles.",
  "frontend/src/utils/assetSmokeCheck.ts": "Empty file with no implementation.",
  "frontend/src/utils/validateProductionSlug.ts": "Validates a production slug for allowed characters and length, returning validity and error message.",
  "frontend/src/valentine/contentDefaults.ts": "Provides default Valentine content including names, headline, letter text, reasons, and empty memory captions.",
  "frontend/src/valentine/types.ts": "Defines the ValentineContent interface describing the structure of customizable Valentine page content.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, shadows, animations, and enabling plugins.",
  "project_state.json": "Tracks project version 21 status, indicating Version 9 is built and ready for go‑live. Includes deployment notes, a slug validation issue, and a list of implemented Valentine‑site features."
}