{
  "backend/main.mo": "Minimal Motoko actor with no methods or state.",
  "feature_evidence.json": "Structured report listing implemented features, related files, components, and test IDs for build verification.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of all main frontend files.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing required assets and steps for building and deploying the Valentine SPA on the Internet Computer.",
  "frontend/index.css": "Tailwind base stylesheet defining global OKLCH color variables, dark mode values, and core UI styling.",
  "frontend/index.html": "Main HTML entry point loading fonts and mounting the React app at the root div.",
  "frontend/src/App.tsx": "Top-level app component managing content state, asset smoke-checks, publish-block logic, and rendering all Valentine sections.",
  "frontend/src/components/valentine/DeploymentHealthOverlay.tsx": "Overlay UI showing detailed asset load failures when the production health check does not pass.",
  "frontend/src/components/valentine/EditPanel.tsx": "Side-sheet editor allowing modification of all Valentine content with normalized caption arrays and safe image upload handling.",
  "frontend/src/components/valentine/FooterSection.tsx": "Footer displaying the sender name, closing message, and a tracked attribution link to caffeine.ai.",
  "frontend/src/components/valentine/HeroSection.tsx": "Renders the hero section with decorative hearts, headline text, and a button that triggers scrolling to the letter section.",
  "frontend/src/components/valentine/LoveLetterSection.tsx": "Displays a styled love letter card with recipient, body text, and sender, using a forwarded ref for scrolling.",
  "frontend/src/components/valentine/MemoriesGallery.tsx": "Shows a 6-tile photo gallery with captions, fallback images, and a lightbox for viewing selected photos.",
  "frontend/src/components/valentine/MemoriesSection.tsx": "Wraps the memories gallery with section styling and a header describing shared moments.",
  "frontend/src/components/valentine/MemoryLightbox.tsx": "Provides a modal lightbox to display a selected memory image with an optional caption and close button.",
  "frontend/src/components/valentine/PublishBlockedScreen.tsx": "Displays an error screen explaining that publishing was blocked and provides guidance and a help link.",
  "frontend/src/components/valentine/ReasonsSection.tsx": "Renders a grid of cards listing reasons for love, each decorated with a heart icon.",
  "frontend/src/components/valentine/ValentineLayout.tsx": "Defines the overall page layout with a textured background, gradient overlay, and wrapped content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity authentication, including login, logout, and stored identities.",
  "frontend/src/hooks/useLocalStorageState.ts": "A hook that syncs a React state value with localStorage for persistence.",
  "frontend/src/hooks/useMemoryImages.ts": "Manages memory gallery image state with defaults, localStorage persistence, migration, and image replacement/reset functions.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark Valentine-themed CSS variables plus custom polaroid frame and shadow utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/assetSmokeCheck.ts": "Provides a smoke‑test utility to preload critical image assets and report failures by asset and group.",
  "frontend/src/valentine/contentDefaults.ts": "Exports default ValentineContent values including names, headline, letter text, reasons, and empty memory captions.",
  "frontend/src/valentine/types.ts": "Defines the ValentineContent interface describing personalization fields for the Valentine page.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, custom colors mapped to CSS vars, fonts, animations, and plugins.",
  "project_state.json": "Describes project state, requirements, known issues, and deployment notes for the Valentine website build."
}